In [2]:
import pandas as pd

In [4]:
nt = pd.read_csv("C:/Users/shaim/Downloads/netflix_titles.csv")

In [5]:
import sqlalchemy as sal
engine = sal.create_engine('mssql://sheyma\SQLEXPRESS/master?driver=ODBC+Driver+17+FOR+SQL+Server')
conn = engine.connect()

In [7]:
nt.to_sql('netflix_raw', con = conn , index= False, if_exists = 'replace')
conn.close()

In [8]:
#Some titles had ?? so check one of them to see if it was due to it being a non-english character
nt[nt.show_id=='s5023']

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
5022,s5023,Movie,반드시 잡는다,Hong-seon Kim,Baek Yoon-sik,South Korea,"February 28, 2018",2017,TV-MA,110 min,"Dramas, International Movies, Thrillers",After people in his town start turning up dead...

In [11]:
# Check max values for each column to decide appropriate column characters 

max(nt.show_id.str.len()) #shows max character is 5, repeat for other columns

5

In [13]:
max(nt.cast.str.len()) #shows nan as max value because that column has null values. These values are picked up as max values

nan

In [14]:
# drop null values to resolve above issue 
max(nt.cast.dropna().str.len())

771

In [15]:
#Now connect python to SQL to load the data 


import sqlalchemy as sal
engine = sal.create_engine('mssql://sheyma\SQLEXPRESS/master?driver=ODBC+Driver+17+FOR+SQL+Server')
conn = engine.connect()

nt.to_sql('netflix_raw', con = conn , index= False, if_exists = 'append')
conn.close()

In [17]:
#check missing values in the final table that was created on MS SQL Server
nt.isnull().sum()

show_id            0
type               0
title              0
director        2634
cast             825
country          831
date_added        10
release_year       0
rating             4
duration           3
listed_in          0
description        0
dtype: int64